index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>My Page on Github</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="My Page on Github"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-25 00:38:04 CST"/>
<meta name="author" content="baohaojun"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="css/default.css" type="text/css">
 <link rel="shortcut icon" href="/poison.png" type="image/png" />


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">My Page on Github</h1>

<p>(For Chinese version of this page, click <a href="index-cn.html">这里</a>).
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 About Me</a></li>
<li><a href="#sec-2">2 Projects</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> About Me</h2>
<div class="outline-text-2" id="text-1">


<p>
I am a software engineer. I write some open source code, mainly to
scratch my own back at first, but I also want it to be more useful to
other people.
</p>
<p>
I use dvp &ndash; <a href="http://www.kaufmann.no/roland/dvorak/index.html">Programmer Dvorak</a> as my keyboard layout, use the same
Input Method(s) under Windows/Linux/Emacs, all developed by
myself. Just to show you what a geek I am:-)
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Projects</h2>
<div class="outline-text-2" id="text-2">


<ul>
<li><a href="beagrep.html">beagrep</a>

<p>  
  Beagrep is a fork of <a href="http://en.wikipedia.org/wiki/Beagle_(software)">beagle</a>, which is a desktop search engine; I
  hacked beagrep to make it more suitable for precise searching, such as code reading.
</p>
<p>
  It has both Linux and Windows version.
</p>
</li>
<li><a href="org-jira.html">org-jira</a>

<p>
  Brings org mode and Jira together.
</p>
</li>
<li>SDIM

<p>
  SDIM, or Shadow Dance Input Method, is an input method I develop and
  use myself only. It is available under 3 platforms, Linux, Windows, and Emacs.
</p>
</li>
<li>Semi Offline Wikipedia

<p>
  It is a fork of <a href="http://users.softlab.ece.ntua.gr/~ttsiod/buildWikipediaOffline.html">this project</a>. I fixed some bugs, updated the
  mediawiki base version, and added one major feature: allow fetching
  pictures when connected to the net (thus the word Semi in the name).
</p>
<p>
  It uses the beagrep project for fast searching.
</p>
</li>
<li>refactory-rename

<p>
  A script for one important refactory activity: renaming.
</p>
<p>
  Supports refactoring any kind of programming language source code.
</p>
</li>
<li>Misc

<p>  
  A lot other stuff I wrote. I always try to write something when I
  face a repetitive problem, even when it's very simple.
</p>
<p>
  You can find them under <a href="https://github.com/baohaojun/windows-config/">windows-config.git</a>. The name has <b>windows</b>
  in it, but it really is not about windows, at least not only
  windows. I know it's not a good name, maybe I will think of a good
  one someday.
</p></li>
</ul>

</div>
</div>
</div>

<div id="postamble">
    <hr/>
    <div style="float:left;width:160px;">
    <iframe width="100%" height="75" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=0&noborder=0&isWeibo=0&isFans=0&uid=1611427581&verifier=936f3b91&dpc=1"></iframe>
    </div>
    <div id="jiathis_style_32x32" style="float:left;margin-left:20px;margin-top:35px;">
        <a class="jiathis_button_tsina"></a>
        <a class="jiathis_button_douban"></a>
        <a class="jiathis_button_tqq"></a>
        <a class="jiathis_button_renren"></a>
        <a class="jiathis_button_douban9dian"></a>
        <!--<a class="jiathis_button_readitlater"></a>-->
        <!--<a class="jiathis_button_instapaper"></a>-->
        <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
        <!--<a class="jiathis_counter_style"></a>-->
    </div>
<script type="text/javascript">
    $(document).ready(function(){
        BYB.includeScript('http://v2.jiathis.com/code/jia.js',function(){})
    });
</script>


</div>
</body>
</html>
